Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/elections_and_referenda/european_elections/eligibility_for_membership_of_the_european_parliament.html.txt.tmx
Source language: en
Languages: ga

source: Eligibility for Membership of the European Parliament
ga: Intofa mar bhall de Pharlaimint na hEorpa

source: The European Parliament is the institution that represents the citizens of the Member States
ga: Is Parlaimint na hEorpa í an institiúid a hionadaíonn na saoránaigh de bhallstát

source: To be eligible for election as a member of the European Parliament (i.e., an MEP), there are certain criteria you must fulfil:
ga: Le bheith intofa mar bhall de Pharlaimint na hEorpa:

source: • You must be a citizen of Ireland or a resident EU citizen
ga: • Ní mór duit a bheith i do shaoránach Éireananch nó saoránach cónáitheach den AE

source: • You must be over 21 years of age and
ga: • Ní mór duit a bheith ós cionn 21 bliain d'aois agus

source: • You must not be disqualified from election to the Dáil
ga: • Ní féidir leat a bheith dícháilithe le toghadh mar Theachta Dála

source: To stand for election, you must be nominated for election
ga: Le seasamh sa toghchán, ní mór duit a bheith ainmnithe

source: You are disqualified from membership of the European Parliament if:
ga: Tá tú dícháilithe mar bhall de Pharlaimint na hEorpa:

source: • you are not a citizen of Ireland or a national of another Member State in the EU
ga: • Muna bhfuil tú i do shaoránach Éireannach nó i do náisiúnach de bhallstát eile den AE

source: • you have not yet reached 21 years of age
ga: • Má tá tú faoi bliain 's fiche d'aois

source: • you are a candidate for election in another member state
ga: • Más iarrthóir toghcháin in aon bhallstát eile thú

source: • you are a national of another Member State and you may not stand as a candidate for election in that Member State because of a law in that Member State
ga: • Más náisiúnach de Bhallstát eile thú agus nach féidir leat seasamh sa Bhallstát sin de bharr an dlí atá i bhfeidhm sa Bhallstát sin

source: • you are a judge or the Comptroller and Auditor General
ga: • Más breitheamh thú nó an tArd-Reachtaire Ciste agus Cuntas

source: • you are a member of the Garda Siochana
ga: • Más ball den Gharda Síochána thú

source: • you are a whole-time member of the Defence Forces
ga: • Más ball lánaimseartha de na Fórsaí Cosanta thú

source: • you are a civil servant and it does not specifically state in your contract of employment that you may be a member of the European Parliament
ga: • Más státseirbhíseach thú, muna bhfuil sé luaite go sonrach i do chonradh fostaíochta go bhfuil cead agat seasamh mar bhall de Pharlaimint na hEorpa

source: • you are a person of unsound mind
ga: • Má tá galar intinne ort

source: • you are presently in prison serving a term greater than 6 months
ga: • Má tá tú sa phríosún ag cur isteach téarma níos mó ná 6 mhí

source: If you are the Attorney General, the Ceann Comhairle of the Dáil, the Cathaoirleach of the Seanad or a Minister of State and you are elected to the European Parliament, you will cease to hold your original post on the day you are elected to the European Parliament
ga: Más tú an tArd Aighne, Ceann Comhairle na Dála, Cathaoirleach an tSeanaid nó Aire Stáit agus má thoghtar tú mar bhall de Pharlaimint na hEorpa tiocfaidh deireadh le do thréimhse sa phost sin ar an lá a thoghtar thú mar bhall de Pharlaimint na hEorpa

source: View a list of existing Members of the European Parliament (MEP's) here
ga: Féach liosta de na Baill atá ar Pharlaimint na hEorpa cheana féin anseo

source: There is more information on european elections on the website of the Department of Housing, Planning, Community and Local Government
ga: Tá tuilleadh eolais maidir le toghcháin na hEorpa ar láithreán gréasáin na Roinne Tithíochta, Pleanála​​, Pobail agus Rialtais Áitiúil
